app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "R"], ["updated_at", "2015-10-06 19:21:56.871995"], ["id", 1]]

  def add_tmdb
    @movie1 = params[:mov]
    if @movie1.nil?
      flash[:notice] = "No Movies selected"
      redirect_to movies_path
    else
      movieid = @movie1.keys
      movieid.each do |tmid|
        Movie.create_from_tmdb(tmid)
---
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Argo 2"], ["rating", "R"], ["release_date", "2015-04-30 00:00:00.000000"], ["created_at", "2015-10-25 20:15:33.765027"], ["updated_at", "2015-10-25 20:15:33.765027"]]